import Image from "next/image";
import { useState } from "react";

import { toast } from "react-toastify";
import bookmark from "../../assets/bookmark-thin.svg";
import breadcrumb from "../../assets/breadcome-book.svg";
import bookLogo from "../../assets/bukhari.svg";
import copy from "../../assets/copy.svg";
import direct from "../../assets/direct.svg";
import lineBar from "../../assets/linebar.svg";
import openBook from "../../assets/open-book.svg";
import report from "../../assets/report.svg";
import share from "../../assets/share.svg";
import triangle from "../../assets/triangle.svg";
import BookmarkModal from "../UI/Modal/Bookmarkmodal";
import ShareModal from "../UI/Modal/ShareModal";
import Category from "../category/Category";

const AllHadith = () => {
  const [isDrawerOpen, setIsDrawerOpen] = useState(false);

  const handleDrawerToggle = () => {
    setIsDrawerOpen(!isDrawerOpen);
  };
  const allHadith = [
    {
      hadith_id: 1,
      book_id: 1,
      book_name: "bukhari",
      chapter_id: 1,
      section_id: 1,
      narrator: "‘আলক্বামাহ ইব্‌নু ওয়াক্কাস আল-লায়সী (রহঃ)",
      bn: "আমি ‘উমর ইব্‌নুল খাত্তাব (রাঃ)-কে মিম্বারের উপর দাঁড়িয়ে বলতে শুনেছিঃ আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছিঃ কাজ (এর প্রাপ্য হবে) নিয়ত অনুযায়ী। আর মানুষ তার নিয়ত অনুযায়ী প্রতিফল পাবে। তাই যার হিজরত হবে ইহকাল লাভের অথবা কোন মহিলাকে বিবাহ করার উদ্দেশ্যে- তবে তার হিজরত সে উদ্দেশ্যেই হবে, যে জন্যে, সে হিজরত করেছে। \n(৫৪, ২৫২৯, ৩৮৯৮, ৫০৭০, ৬৬৮৯, ৬৯৫৩; মুসলিম ২৩/৪৫ হাঃ ১৯০৭, আহমাদ ১৬৮) ( আধুনিক প্রকাশনী- ১, ইসলামিক ফাউন্ডেশন ১)",
      ar: 'حَدَّثَنَا الْحُمَيْدِيُّ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الأَنْصَارِيُّ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ، يَقُولُ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ عَلَى الْمِنْبَرِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ "‏ إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوْ إِلَى امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ',
      ar_diacless:
        'حدثنا الحميدي عبد الله بن الزبير، قال حدثنا سفيان، قال حدثنا يحيى بن سعيد الأنصاري، قال أخبرني محمد بن إبراهيم التيمي، أنه سمع علقمة بن وقاص الليثي، يقول سمعت عمر بن الخطاب ـ رضى الله عنه ـ على المنبر قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ "‏ إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى دنيا يصيبها أو إلى امرأة ينكحها فهجرته إلى ما هاجر إليه',
      note: "",
      grade_id: 2,
      grade: "সহিহ হাদিস",
      grade_color: "#46B891",
      section_title:
        "আল্লাহ্‌র রসূল (সাল্লাল্লাহু 'আলাইহি ওয়া সাল্লাম)- এর প্রতি কীভাবে ওয়াহী [১] শুরু হয়েছিল।",
      preface:
        "এ মর্মে  আল্লাহ তা’আলার বাণীঃ “নিশ্চয়ই আমি আপনার প্রতি সেরূপ ওয়াহী প্রেরণ করেছি যেরূপ নূহ ও তাঁর পরবর্তী নবীদের প্রতি ওয়াহী প্রেরণ করেছিলাম”। (সূরা আন-নিসা ৪/১৬৩)",
      section_number: "১/১. অধ্যায়ঃ",
      chapter_title: "ওহীর সূচনা অধ্যায়",
      chapter_number: 1,
    },
    {
      hadith_id: 2,
      book_id: 1,
      book_name: "bukhari",
      chapter_id: 1,
      section_id: 2,
      narrator: "উম্মুল মু’মিনীন ‘আয়িশা (রাঃ)",
      bn: "হারিস ইব্‌নু হিশাম (রাঃ) আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- কে জিজ্ঞেস করলেন, ‘হে আল্লাহর রসূল! আপনার নিকট ওয়াহী কিরূপে আসে?’ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ [কোন কোন সময় তা ঘন্টা বাজার মত আমার নিকট আসে। আর এটি-ই আমার উপর সবচেয়ে বেদনাদায়ক হয় এবং তা শেষ হতেই মালাক (ফেরেশতা) যা বলেন তা আমি মুখস্ত করে নেই, আবার কখনো মালাক মানুষের রূপ ধারণ করে আমার সাথে কথা বলেন। তিনি যা বলেন আমি তা মুখস্ত করে নেই।] ‘আয়িশা (রাঃ) বলেন, আমি তীব্র শীতের সময় ওয়াহী নাযিলরত অবস্থায় তাঁকে দেখেছি। ওয়াহী শেষ হলেই তাঁর ললাট হতে ঘাম ঝরে পড়ত। (৩২১৫; মুসলিম ৪৩/২৩, হাঃ ২৩৩৩, আহমাদ ২৫৩০৭, ২৬২৫৮) (আধুনিক প্রকাশনীঃ ২, ইসলামী ফাউন্ডেশনঃ ২)",
      ar: 'حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ أَنَّ الْحَارِثَ بْنَ هِشَامٍ ـ رضى الله عنه ـ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ يَأْتِيكَ الْوَحْىُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ "‏ أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الْجَرَسِ ـ وَهُوَ أَشَدُّهُ عَلَىَّ ـ فَيُفْصَمُ عَنِّي وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ، وَأَحْيَانًا يَتَمَثَّلُ لِيَ الْمَلَكُ رَجُلاً فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ ‏"‏‏.‏ قَالَتْ عَائِشَةُ رضى الله عنها وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ الْوَحْىُ فِي الْيَوْمِ الشَّدِيدِ الْبَرْدِ، فَيَفْصِمُ عَنْهُ وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا‏.',
      ar_diacless:
        'حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة أم المؤمنين ـ رضى الله عنها ـ أن الحارث بن هشام ـ رضى الله عنه ـ سأل رسول الله صلى الله عليه وسلم فقال يا رسول الله كيف يأتيك الوحى فقال رسول الله صلى الله عليه وسلم ‏ "‏ أحيانا يأتيني مثل صلصلة الجرس ـ وهو أشده على ـ فيفصم عني وقد وعيت عنه ما قال، وأحيانا يتمثل لي الملك رجلا فيكلمني فأعي ما يقول ‏"‏‏.‏ قالت عائشة رضى الله عنها ولقد رأيته ينزل عليه الوحى في اليوم الشديد البرد، فيفصم عنه وإن جبينه ليتفصد عرقا‏.',
      note: "",
      grade_id: 2,
      grade: "সহিহ হাদিস",
      grade_color: "#46B891",
      section_title: "১/২. অধ্যায়ঃ",
      preface: "",
      section_number: "১/২. অধ্যায়ঃ",
      chapter_title: "ওহীর সূচনা অধ্যায়",
      chapter_number: 1,
    },
    {
      hadith_id: 3,
      book_id: 1,
      book_name: "bukhari",
      chapter_id: 1,
      section_id: 3,
      narrator: "উম্মুল মু’মিনীন ‘আয়িশা (রাঃ)",
      bn: "তিনি বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- এর নিকট সর্বপ্রথম যে ওয়াহী আসে, তা ছিল নিদ্রাবস্থায় বাস্তব স্বপ্নরূপে। যে স্বপ্নই তিনি দেখতেন তা একেবারে প্রভাতের আলোর ন্যায় প্রকাশিত হতো। অতঃপর তাঁর নিকট নির্জনতা পছন্দনীয় হয়ে দাঁড়ায় এবং তিনি ‘হেরা’র গুহায় নির্জনে অবস্থান করতেন। আপন পরিবারের নিকট ফিরে এসে কিছু খাদ্যসামগ্রী সঙ্গে নিয়ে যাওয়ার পূর্বে- এভাবে সেখানে তিনি এক নাগাড়ে বেশ কয়েক দিন ‘ইবাদাতে মগ্ন থাকতেন। অতঃপর  খাদীজা (রাঃ)-এর নিকট  ফিরে এসে আবার একই সময়ের জন্য কিছু খাদ্যদ্রব্য নিয়ে যেতেন। এভাবে ‘হেরা’ গুহায় অবস্থানকালে তাঁর নিকট ওয়াহী আসলো।  তাঁর নিকট ফেরেশতা এসে বললো, ‘পাঠ করুন’। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেনঃ [“আমি বললাম, ‘আমি পড়তে জানি না।] তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেনঃ অতঃপর সে আমাকে জড়িয়ে ধরে এমন ভাবে চাপ দিলো যে, আমার খুব কষ্ট হলো। অতঃপর সে আমাকে ছেড়ে দিয়ে বললো, ‘পাঠ করুন’। আমি বললামঃ আমি তো পড়তে জানি না’। সে দ্বিতীয় বার আমাকে জড়িয়ে ধরে এমনভাবে চাপ দিলো যে, আমার খুব কষ্ট হলো। অতঃপর সে আমাকে ছেড়ে দিয়ে  বললো, ‘পাঠ করুন’। আমি উত্তর দিলাম, ‘আমি তো পড়তে জানি না’। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, অতঃপর তৃতীয়বারে তিনি আমাকে জড়িয়ে ধরে চাপ দিলেন। তারপর ছেড়ে দিয়ে বললেন, “পাঠ করুন আপনার রবের নামে, যিনি সৃষ্টি করেছেন। যিনি সৃষ্টি করেছেন মানুষকে জমাট রক্ত পিন্ড থেকে, পাঠ করুন, আর আপনার রব অতিশয় দয়ালু”- (সূরা আলাক্ব ৯৬/১-৩)। অতঃপর এ আয়াত নিয়ে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- প্রত্যাবর্তন করলেন। তাঁর হৃদয় তখন কাঁপছিল। তিনি খাদীজা বিন্‌তু খুওয়ায়লিদের নিকট এসে বললেন, ‘আমাকে চাদর দ্বারা আবৃত কর’, ‘আমাকে চাদর দ্বারা আবৃত কর’। তাঁরা তাঁকে চাদর দ্বারা আবৃত করলেন। এমনকি তাঁর শংকা দূর হলো। তখন তিনি খাদীজা (রাঃ) এর নিকট ঘটনাবৃত্তান্ত জানিয়ে তাঁকে বললেন, আমি আমার নিজেকে নিয়ে শংকা বোধ করছি। খাদীজা (রাঃ) বললেন, আল্লাহর কসম, কখনই নয়। আল্লাহ আপনাকে কখনো লাঞ্ছিত করবেন না।  আপনি তো আত্মীয়–স্বজনের সঙ্গে সদাচরণ করেন, অসহায় দুস্থদের দায়িত্ব বহন করেন, নিঃস্বকে সহযোগিতা করেন, মেহমানের আপ্যায়ন করেন এবং হক পথের দুর্দশাগ্রস্থকে সাহায্য করেন। অতঃপর তাঁকে নিয়ে খাদীজা (রাঃ) তাঁর চাচাত ভাই ওয়ারাকাহ ইব্‌নু নাওফাল ইব্‌নু ‘আবদুল আসাদ ইব্‌নু ‘আবদুল ‘উযযাহ’র নিকট গেলেন, যিনি অন্ধকার যুগে ‘ঈসায়ী ধর্ম গ্রহন করেছিলেন। যিনি ইবরানী ভাষায় লিখতে পারতেন এবং আল্লাহর তাওফীক অনুযায়ী ইবরানী ভাষায় ইনজীল হতে ভাষান্তর করতেন। তিনি ছিলেন অতি বৃদ্ধ এবং অন্ধ হয়ে গিয়েছিলেন। খাদীজা (রাঃ) তাঁকে বললেন, ‘হে চাচাত ভাই! আপনার ভাতিজার কথা শুনুন’। ওয়ারাকাহ তাঁকে জিজ্ঞেস করলেন, ‘ভাতিজা! তুমি কী দেখ?’ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) যা দেখেছিলেন, সবই বর্ণনা করলেন। তখন ওয়ারাকাহ তাঁকে বললেন, এটা সেই বার্তাবাহক যাকে আল্লাহ মূসা (‘আঃ)- এর নিকট পাঠিয়েছিলেন। আফসোস! আমি যদি সেদিন যুবক থাকতাম। আফসোস ! আমি যদি সেদিন জীবিত থাকতাম, যেদিন তোমার কওম তোমাকে বহিষ্কার করবে’। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, [‘তারা কি আমাকে বের করে দেবে?’] তিনি বললেন, ‘হ্যাঁ, তুমি যা নিয়ে এসেছো অনুরূপ (ওয়াহী) কিছু যিনিই নিয়ে এসেছেন তাঁর সঙ্গেই বৈরিতাপূর্ণ আচরণ করা হয়েছে। সেদিন যদি আমি থাকি, তবে তোমাকে জোরালোভাবে সাহায্য করব। এর কিছুদিন পর ওয়ারাকাহ (‘আঃ) ইন্তিকাল করেন। আর ওয়াহীর বিরতি ঘটে।(৩৩৯২, ৪৯৫৩, ৪৯৫৫, ৪৯৫৬, ৪৯৫৭, ৬৯৮২; মুসলিম ১/৭৩ হাঃ ১৬০, আহমাদ ২৬০১৮) (আধুনিক প্রকাশনীঃ ৩, ইসলামী ফাউন্ডেশনঃ ৩)",
      ar: 'حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْوَحْىِ الرُّؤْيَا الصَّالِحَةُ فِي النَّوْمِ، فَكَانَ لاَ يَرَى رُؤْيَا إِلاَّ جَاءَتْ مِثْلَ فَلَقِ الصُّبْحِ، ثُمَّ حُبِّبَ إِلَيْهِ الْخَلاَءُ، وَكَانَ يَخْلُو بِغَارِ حِرَاءٍ فَيَتَحَنَّثُ فِيهِ ـ وَهُوَ التَّعَبُّدُ ـ اللَّيَالِيَ ذَوَاتِ الْعَدَدِ قَبْلَ أَنْ يَنْزِعَ إِلَى أَهْلِهِ، وَيَتَزَوَّدُ لِذَلِكَ، ثُمَّ يَرْجِعُ إِلَى خَدِيجَةَ، فَيَتَزَوَّدُ لِمِثْلِهَا، حَتَّى جَاءَهُ الْحَقُّ وَهُوَ فِي غَارِ حِرَاءٍ، فَجَاءَهُ الْمَلَكُ فَقَالَ اقْرَأْ‏.‏ قَالَ ‏"‏ مَا أَنَا بِقَارِئٍ ‏"‏‏.‏ قَالَ ‏"‏ فَأَخَذَنِي فَغَطَّنِي حَتَّى بَلَغَ مِنِّي الْجَهْدَ، ثُمَّ أَرْسَلَنِي فَقَالَ اقْرَأْ‏.‏ قُلْتُ مَا أَنَا بِقَارِئٍ‏.‏ فَأَخَذَنِي فَغَطَّنِي الثَّانِيَةَ حَتَّى بَلَغَ مِنِّي الْجَهْدَ، ثُمَّ أَرْسَلَنِي فَقَالَ اقْرَأْ‏.‏ فَقُلْتُ مَا أَنَا بِقَارِئٍ‏.‏ فَأَخَذَنِي فَغَطَّنِي الثَّالِثَةَ، ثُمَّ أَرْسَلَنِي فَقَالَ ‏{‏اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ * خَلَقَ الإِنْسَانَ مِنْ عَلَقٍ * اقْرَأْ وَرَبُّكَ الأَكْرَمُ‏}‏ ‏"‏‏.‏ فَرَجَعَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَرْجُفُ فُؤَادُهُ، فَدَخَلَ عَلَى خَدِيجَةَ بِنْتِ خُوَيْلِدٍ رضى الله عنها فَقَالَ ‏"‏ زَمِّلُونِي زَمِّلُونِي ‏"‏‏.‏ فَزَمَّلُوهُ حَتَّى ذَهَبَ عَنْهُ الرَّوْعُ، فَقَالَ لِخَدِيجَةَ وَأَخْبَرَهَا الْخَبَرَ ‏"‏ لَقَدْ خَشِيتُ عَلَى نَفْسِي ‏"‏‏.‏ فَقَالَتْ خَدِيجَةُ كَلاَّ وَاللَّهِ مَا يُخْزِيكَ اللَّهُ أَبَدًا، إِنَّكَ لَتَصِلُ الرَّحِمَ، وَتَحْمِلُ الْكَلَّ، وَتَكْسِبُ الْمَعْدُومَ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ‏.‏ فَانْطَلَقَتْ بِهِ خَدِيجَةُ حَتَّى أَتَتْ بِهِ وَرَقَةَ بْنَ نَوْفَلِ بْنِ أَسَدِ بْنِ عَبْدِ الْعُزَّى ابْنَ عَمِّ خَدِيجَةَ ـ وَكَانَ امْرَأً تَنَصَّرَ فِي الْجَاهِلِيَّةِ، وَكَانَ يَكْتُبُ الْكِتَابَ الْعِبْرَانِيَّ، فَيَكْتُبُ مِنَ الإِنْجِيلِ بِالْعِبْرَانِيَّةِ مَا شَاءَ اللَّهُ أَنْ يَكْتُبَ، وَكَانَ شَيْخًا كَبِيرًا قَدْ عَمِيَ ـ فَقَالَتْ لَهُ خَدِيجَةُ يَا ابْنَ عَمِّ اسْمَعْ مِنَ ابْنِ أَخِيكَ‏.‏ فَقَالَ لَهُ وَرَقَةُ يَا ابْنَ أَخِي مَاذَا تَرَى فَأَخْبَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم خَبَرَ مَا رَأَى‏.‏ فَقَالَ لَهُ وَرَقَةُ هَذَا النَّامُوسُ الَّذِي نَزَّلَ اللَّهُ عَلَى مُوسَى صلى الله عليه وسلم يَا لَيْتَنِي فِيهَا جَذَعًا، لَيْتَنِي أَكُونُ حَيًّا إِذْ يُخْرِجُكَ قَوْمُكَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏"‏ أَوَمُخْرِجِيَّ هُمْ ‏"‏‏.‏ قَالَ نَعَمْ، لَمْ يَأْتِ رَجُلٌ قَطُّ بِمِثْلِ مَا جِئْتَ بِهِ إِلاَّ عُودِيَ، وَإِنْ يُدْرِكْنِي يَوْمُكَ أَنْصُرْكَ نَصْرًا مُؤَزَّرًا‏.‏ ثُمَّ لَمْ يَنْشَبْ وَرَقَةُ أَنْ تُوُفِّيَ وَفَتَرَ الْوَحْىُ‏.‏',
      ar_diacless:
        'حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة بن الزبير، عن عائشة أم المؤمنين، أنها قالت أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحى الرؤيا الصالحة في النوم، فكان لا يرى رؤيا إلا جاءت مثل فلق الصبح، ثم حبب إليه الخلاء، وكان يخلو بغار حراء فيتحنث فيه ـ وهو التعبد ـ الليالي ذوات العدد قبل أن ينزع إلى أهله، ويتزود لذلك، ثم يرجع إلى خديجة، فيتزود لمثلها، حتى جاءه الحق وهو في غار حراء، فجاءه الملك فقال اقرأ‏.‏ قال ‏"‏ ما أنا بقارئ ‏"‏‏.‏ قال ‏"‏ فأخذني فغطني حتى بلغ مني الجهد، ثم أرسلني فقال اقرأ‏.‏ قلت ما أنا بقارئ‏.‏ فأخذني فغطني الثانية حتى بلغ مني الجهد، ثم أرسلني فقال اقرأ‏.‏ فقلت ما أنا بقارئ‏.‏ فأخذني فغطني الثالثة، ثم أرسلني فقال ‏{‏اقرأ باسم ربك الذي خلق * خلق الإنسان من علق * اقرأ وربك الأكرم‏}‏ ‏"‏‏.‏ فرجع بها رسول الله صلى الله عليه وسلم يرجف فؤاده، فدخل على خديجة بنت خويلد رضى الله عنها فقال ‏"‏ زملوني زملوني ‏"‏‏.‏ فزملوه حتى ذهب عنه الروع، فقال لخديجة وأخبرها الخبر ‏"‏ لقد خشيت على نفسي ‏"‏‏.‏ فقالت خديجة كلا والله ما يخزيك الله أبدا، إنك لتصل الرحم، وتحمل الكل، وتكسب المعدوم، وتقري الضيف، وتعين على نوائب الحق‏.‏ فانطلقت به خديجة حتى أتت به ورقة بن نوفل بن أسد بن عبد العزى ابن عم خديجة ـ وكان امرأ تنصر في الجاهلية، وكان يكتب الكتاب العبراني، فيكتب من الإنجيل بالعبرانية ما شاء الله أن يكتب، وكان شيخا كبيرا قد عمي ـ فقالت له خديجة يا ابن عم اسمع من ابن أخيك‏.‏ فقال له ورقة يا ابن أخي ماذا ترى فأخبره رسول الله صلى الله عليه وسلم خبر ما رأى‏.‏ فقال له ورقة هذا الناموس الذي نزل الله على موسى صلى الله عليه وسلم يا ليتني فيها جذعا، ليتني أكون حيا إذ يخرجك قومك‏.‏ فقال رسول الله صلى الله عليه وسلم ‏"‏ أومخرجي هم ‏"‏‏.‏ قال نعم، لم يأت رجل قط بمثل ما جئت به إلا عودي، وإن يدركني يومك أنصرك نصرا مؤزرا‏.‏ ثم لم ينشب ورقة أن توفي وفتر الوحى‏.‏',
      note: "",
      grade_id: 2,
      grade: "সহিহ হাদিস",
      grade_color: "#46B891",
      section_title: "১/৩. অধ্যায়ঃ",
      preface: "",
      section_number: "১/৩. অধ্যায়ঃ",
      chapter_title: "ওহীর সূচনা অধ্যায়",
      chapter_number: 1,
    },
    {
      hadith_id: 4,
      book_id: 1,
      book_name: "bukhari",
      chapter_id: 1,
      section_id: 3,
      narrator: "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ আনসারী (রাঃ)",
      bn: "ওয়াহী স্থগিত হওয়া প্রসঙ্গে বর্ণনা করেন যে, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ একদা আমি হাঁটছি, হঠাৎ আসমান থেকে একটা শব্দ শুনতে পেয়ে আমার দৃষ্টিকে উপরে তুললাম। দেখলাম, সেই ফেরেশতা, যিনি হেরা গুহায় আমার নিকট এসেছিলেন, আসমান ও যমীনের মাঝে একটি আসনে উপবিষ্ট। এতে আমি শংকিত হলাম। অবিলম্বে আমি ফিরে এসে বললাম, ‘আমাকে চাদর দ্বারা আবৃত কর’, ‘আমাকে চাদর দ্বারা আবৃত কর’। অতঃপর আল্লাহ তা’আলা অবতীর্ণ করলেন,  “হে বস্ত্রাবৃত রসূল! (১) উঠুন, সতর্ক করুন; আর আপনার রবের শ্রেষ্ঠত্ব  ঘোষণা করুন; এবং স্বীয় পরিধেয় বস্ত্র পবিত্র রাখুন; (৫) এবং অপবিত্রতা থেকে দূরে থাকুন”। (সূরা মুদ‌্দাসসির ৭৪/১-৫) অতঃপর ওয়াহী পুরোদমে ধারাবাহিক অবতীর্ণ হতে লাগল। ‘আবদুল্লাহ ইব্‌নু ইউসূফ (রহঃ) ও আবূ সালেহ (রহঃ) অনুরূপ বর্ণনা করেছেন। হিলাল ইব্‌নু রাদদাদ (রহঃ) যুহরী (রহঃ) থেকেও অনুরূপ বর্ণনা করেছেন। ইউনুস ও মা’মার  فواده এর স্থলে بَوَادِرُهُ শব্দ উল্লেখ করেছেন।\n(৩২৩৮, ৪৯২২, ৪৯২৩, ৪৯২৪, ৪৯২৫, ৪৯২৬, ৪৯৫৪, ৬২১৪; মুসলিম ১/৩৮ হাঃ ১৬১, আহমাদ ১৫০৩৯) (আধুনিক প্রকাশনীঃ ৩ শেষাংশ, ইসলামী ফাউন্ডেশনঃ ৩ শেষাংশ)",
      ar: 'قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيَّ، قَالَ ـ وَهُوَ يُحَدِّثُ عَنْ فَتْرَةِ الْوَحْىِ، فَقَالَ ـ فِي حَدِيثِهِ ‏"‏ بَيْنَا أَنَا أَمْشِي، إِذْ سَمِعْتُ صَوْتًا، مِنَ السَّمَاءِ، فَرَفَعْتُ بَصَرِي فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ جَالِسٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالأَرْضِ، فَرُعِبْتُ مِنْهُ، فَرَجَعْتُ فَقُلْتُ زَمِّلُونِي‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏يَا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنْذِرْ‏}‏ إِلَى قَوْلِهِ ‏{‏وَالرُّجْزَ فَاهْجُرْ‏}‏ فَحَمِيَ الْوَحْىُ وَتَتَابَعَ ‏"‏‏.‏ تَابَعَهُ عَبْدُ اللَّهِ بْنُ يُوسُفَ وَأَبُو صَالِحٍ‏.‏ وَتَابَعَهُ هِلاَلُ بْنُ رَدَّادٍ عَنِ الزُّهْرِيِّ‏.‏ وَقَالَ يُونُسُ وَمَعْمَرٌ ‏"‏ بَوَادِرُهُ ‏"‏‏.‏',
      ar_diacless:
        'قال ابن شهاب وأخبرني أبو سلمة بن عبد الرحمن، أن جابر بن عبد الله الأنصاري، قال ـ وهو يحدث عن فترة الوحى، فقال ـ في حديثه ‏"‏ بينا أنا أمشي، إذ سمعت صوتا، من السماء، فرفعت بصري فإذا الملك الذي جاءني بحراء جالس على كرسي بين السماء والأرض، فرعبت منه، فرجعت فقلت زملوني‏.‏ فأنزل الله تعالى ‏{‏يا أيها المدثر * قم فأنذر‏}‏ إلى قوله ‏{‏والرجز فاهجر‏}‏ فحمي الوحى وتتابع ‏"‏‏.‏ تابعه عبد الله بن يوسف وأبو صالح‏.‏ وتابعه هلال بن رداد عن الزهري‏.‏ وقال يونس ومعمر ‏"‏ بوادره ‏"‏‏.‏',
      note: "",
      grade_id: 2,
      grade: "সহিহ হাদিস",
      grade_color: "#46B891",
      section_title: "১/৩. অধ্যায়ঃ",
      preface: "",
      section_number: "১/৩. অধ্যায়ঃ",
      chapter_title: "ওহীর সূচনা অধ্যায়",
      chapter_number: 1,
    },
    {
      hadith_id: 5,
      book_id: 1,
      book_name: "bukhari",
      chapter_id: 1,
      section_id: 4,
      narrator: "ইব্‌নু আব্বাস (রাঃ)",
      bn: "মহান আল্লাহর বাণীঃ “ওয়াহী দ্রুত আয়ত্ত করার জন্য আপনি ওয়াহী নাযিল হওয়ার সময় আপনার জিহ্বা নাড়বেন না”। (সূরা ক্বিয়ামাহ ৭৫/১৬)-এর ব্যাখ্যায় ইব্‌নু ‘আব্বাস বলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ওয়াহী অবতরণের সময় তা আয়ত্ত করতে বেশ কষ্ট করতেন এবং প্রায়ই তিনি তাঁর উভয় ঠোঁট নড়াতেন’। ইব্‌নু ‘আব্বাস (রাঃ) বলেন, ‘আমি তোমাকে দেখানোর জন্য ঠোঁট দুটি নাড়ছি যেভাবে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তা নড়াতেন’। সা’ঈদ (রহঃ) (তাঁর শিষ্যদের) বলেন, ‘আমি ইব্‌নু ‘আব্বাস (রাঃ)-কে যেরূপে তাঁর ঠোঁট দুটি নড়াতে দেখেছি, সেভাবেই আমার ঠোঁট দুটি নড়াচ্ছি’।  এই বলে তিনি তাঁর ঠোঁট দুটি নড়ালেন। এ সম্পর্কে আল্লাহ তা’আলা অবতীর্ণ করলেনঃ “ওয়াহী দ্রুত আয়ত্ত করার জন্য আপনি ওয়াহী নাযিল হবার সময় আপনার জিহ্বা নড়াবেন না, এর সংরক্ষণ ও পাঠ করানোর দায়িত্ব আমার”। (সূরা ক্বিয়ামাহ ৭৫/১৬)। ইব্‌নু 'আব্বাস (রাঃ) বলেন, “এর অর্থ হলোঃ তোমার অন্তরে তা হেফাযত করা এবং তোমার দ্বারা তা পাঠ করানো। “সুতরাং আমি যখন তা পাঠ করি, তখন আপনি সেই পাঠের অনুসরণ করুন”- (সূরা ক্বিয়ামাহ ৭৫/১৮)। ইব্‌নু আব্বাস (রাঃ) বলেন, অর্থাৎ মনোযোগ সহকারে শুন এবং চুপ থাক। “তারপর এর বিশদ বর্ণনার দায়িত্ব তো আমারই”-(সূরা ক্বিয়ামাহ ৭৫/১৯)। অর্থাৎ তুমি তা পাঠ করবে, এটাও আমার দায়িত্ব। তারপর যখন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- এর নিকট জিবরীল (‘আঃ) আসতেন, তখন তিনি মনোযোগ দিয়ে কেবল শুনতেন। জিবরীল (‘আঃ) চলে যাবার পর তিনি যেমন পাঠ করেছিলেন, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-ও তদ্রুপ পাঠ করতেন।\n(৪৯২৭, ৪৯২৮, ৪৯২৯, ৫০৪৪, ৭৫২৪; মুসলিম ৪/৩২ হাঃ ৪৪৮, আহমাদ ৩১৯১) (আধুনিক প্রকাশনীঃ ৪, ইসলামী ফাউন্ডেশনঃ ৪-এর শেষাংশ)",
      ar: "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، قَالَ حَدَّثَنَا مُوسَى بْنُ أَبِي عَائِشَةَ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ تَعَالَى ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ‏}‏ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَالِجُ مِنَ التَّنْزِيلِ شِدَّةً، وَكَانَ مِمَّا يُحَرِّكُ شَفَتَيْهِ ـ فَقَالَ ابْنُ عَبَّاسٍ فَأَنَا أُحَرِّكُهُمَا لَكُمْ كَمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحَرِّكُهُمَا‏.‏ وَقَالَ سَعِيدٌ أَنَا أُحَرِّكُهُمَا كَمَا رَأَيْتُ ابْنَ عَبَّاسٍ يُحَرِّكُهُمَا‏.‏ فَحَرَّكَ شَفَتَيْهِ ـ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ* إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ‏}‏ قَالَ جَمْعُهُ لَهُ فِي صَدْرِكَ، وَتَقْرَأَهُ ‏{‏فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ‏}‏ قَالَ فَاسْتَمِعْ لَهُ وَأَنْصِتْ ‏{‏ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ‏}‏ ثُمَّ إِنَّ عَلَيْنَا أَنْ تَقْرَأَهُ‏.‏ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْدَ ذَلِكَ إِذَا أَتَاهُ جِبْرِيلُ اسْتَمَعَ، فَإِذَا انْطَلَقَ جِبْرِيلُ قَرَأَهُ النَّبِيُّ صلى الله عليه وسلم كَمَا قَرَأَهُ‏.‏",
      ar_diacless:
        "حدثنا موسى بن إسماعيل، قال حدثنا أبو عوانة، قال حدثنا موسى بن أبي عائشة، قال حدثنا سعيد بن جبير، عن ابن عباس، في قوله تعالى ‏{‏لا تحرك به لسانك لتعجل به‏}‏ قال كان رسول الله صلى الله عليه وسلم يعالج من التنزيل شدة، وكان مما يحرك شفتيه ـ فقال ابن عباس فأنا أحركهما لكم كما كان رسول الله صلى الله عليه وسلم يحركهما‏.‏ وقال سعيد أنا أحركهما كما رأيت ابن عباس يحركهما‏.‏ فحرك شفتيه ـ فأنزل الله تعالى ‏{‏لا تحرك به لسانك لتعجل به* إن علينا جمعه وقرآنه‏}‏ قال جمعه له في صدرك، وتقرأه ‏{‏فإذا قرأناه فاتبع قرآنه‏}‏ قال فاستمع له وأنصت ‏{‏ثم إن علينا بيانه‏}‏ ثم إن علينا أن تقرأه‏.‏ فكان رسول الله صلى الله عليه وسلم بعد ذلك إذا أتاه جبريل استمع، فإذا انطلق جبريل قرأه النبي صلى الله عليه وسلم كما قرأه‏.‏",
      note: "",
      grade_id: 2,
      grade: "সহিহ হাদিস",
      grade_color: "#46B891",
      section_title: "১/৪. অধ্যায়ঃ",
      preface: "",
      section_number: "১/৪. অধ্যায়ঃ",
      chapter_title: "ওহীর সূচনা অধ্যায়",
      chapter_number: 1,
    },
    {
      hadith_id: 6,
      book_id: 1,
      book_name: "bukhari",
      chapter_id: 1,
      section_id: 5,
      narrator: "ইব্‌নু ‘আব্বাস (রাঃ)",
      bn: "তিনি বলেন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ছিলেন সর্বশ্রেষ্ঠ দানশীল। রমাযানে তিনি আরো অধিক দানশীল হতেন, যখন জিবরীল (‘আঃ) তাঁর সঙ্গে সাক্ষাৎ করতেন। আর রমাযানের প্রতি রাতেই জিবরীল (‘আঃ) তাঁর সাথে দেখা করতেন এবং তারা একে অপরকে কুরআন তিলাওয়াত করে শোনাতেন। নিশ্চয়ই আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) রহমতের বায়ু অপেক্ষাও অধিক দানশীল ছিলেন।\n\n(১৯০২, ৩২২০, ৩৫৫৪, ৪৯৯৭; মুসলিম ৪৩/১২ হাঃ ৩২০৮, আহমাদ ৩৬১৬, ৩৪২৫) (আধুনিক প্রকাশনীঃ ৫, ইসলামী ফাউন্ডেশনঃ ৫)",
      ar: "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، ح وَحَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، وَمَعْمَرٌ، عَنِ الزُّهْرِيِّ، نَحْوَهُ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَجْوَدَ النَّاسِ، وَكَانَ أَجْوَدُ مَا يَكُونُ فِي رَمَضَانَ حِينَ يَلْقَاهُ جِبْرِيلُ، وَكَانَ يَلْقَاهُ فِي كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ فَيُدَارِسُهُ الْقُرْآنَ، فَلَرَسُولُ اللَّهِ صلى الله عليه وسلم أَجْوَدُ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ",
      ar_diacless:
        "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا يونس، عن الزهري، ح وحدثنا بشر بن محمد، قال أخبرنا عبد الله، قال أخبرنا يونس، ومعمر، عن الزهري، نحوه قال أخبرني عبيد الله بن عبد الله، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم أجود الناس، وكان أجود ما يكون في رمضان حين يلقاه جبريل، وكان يلقاه في كل ليلة من رمضان فيدارسه القرآن، فلرسول الله صلى الله عليه وسلم أجود بالخير من الريح المرسلة",
      note: "",
      grade_id: 2,
      grade: "সহিহ হাদিস",
      grade_color: "#46B891",
      section_title: "১/৫. অধ্যায়ঃ",
      preface: "",
      section_number: "১/৫. অধ্যায়ঃ",
      chapter_title: "ওহীর সূচনা অধ্যায়",
      chapter_number: 1,
    },
    {
      hadith_id: 7,
      book_id: 1,
      book_name: "bukhari",
      chapter_id: 1,
      section_id: 6,
      narrator: "‘আবদুল্লাহ ইব্‌নু ‘আব্বাস (রাঃ)",
      bn: "আবূ সুফিয়ান ইব্‌নু হরব তাকে বলেছেন, রাজা হিরাক্লিয়াস একদা তাঁর নিকট লোক প্রেরণ করলেন। তিনি তখন ব্যবসা উপলক্ষে কুরাইশদের কাফেলায় সিরিয়ায় ছিলেন। আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সে সময় আবূ সুফিয়ান ও কুরাইশদের সঙ্গে নির্দিষ্ট সময়ের জন্য সন্ধিতে আবদ্ধ ছিলেন। আবূ সুফিয়ান তার সাথী সহ হিরাক্লিয়াসের নিকট আসলেন এবং দোভাষীকে ডাকলেন। অতঃপর জিজ্ঞেস করলেন, ‘এই যে ব্যক্তি নিজেকে নবী বলে দাবী করে-তোমাদের মাঝে বংশের দিক হতে তাঁর সবচেয়ে  নিকটাত্মীয় কে’? আবূ সুফিয়ান বলেন, ‘আমি বললাম, বংশের দিক দিয়ে আমিই তাঁর নিকটাত্মীয়’। তিনি বললেন, ‘তাঁকে আমার অতি নিকটে আন এবং তাঁর সাথীদেরকেও তার পেছনে বসিয়ে দাও’।\nঅতঃপর তাঁর দোভাষীকে বললেন, ‘তাদের বলে দাও, আমি এর নিকট সে ব্যক্তি সম্পর্কে কিছু জিজ্ঞেস করব, যদি সে আমার নিকট মিথ্যা বলে, তখন সঙ্গে সঙ্গে তোমরা তাকে মিথ্যুক বলবে। আবূ সুফিয়ান বলেন, ‘আল্লাহর কসম! আমার যদি এ লজ্জা না থাকত যে, তারা আমাকে মিথ্যাবাদী বলে প্রচার করবে, তবে আমি অবশ্যই তাঁর সম্পর্কে মিথ্যা বলতাম’।\nঅতঃপর তিনি তাঁর সম্পর্কে  আমাকে সর্বপ্রথম যে প্রশ্ন করেন তা হলো, ‘বংশমর্যাদার দিক দিয়ে তোমাদের মধ্যে সে কিরূপ?’ আমি বললাম, ‘তিনি আমাদের মধ্যে খুব সম্ভ্রান্ত বংশের’। তিনি বললেন, ‘তোমাদের মধ্যে এর পূর্বে আর কখনো কি কেউ এরূপ কথা বলেছে?’ আমি বললাম, ‘না’। তিনি বললেন, ‘তাঁর পূর্বপুরুষের মধ্যে কেউ কি বাদশাহ ছিলেন?’ আমি বললাম, ‘না’। তিনি বললেন, ‘সম্ভ্রান্ত মর্যাদাবান শ্রেণীর লোকেরা তাঁর অনুসরণ করে, নাকি দুর্বল লোকেরা?’ আমি বললাম, ‘দুর্বল লোকেরা’। তিনি বললেন, ‘তাদের সংখ্যা কি বাড়ছে, না কমছে?’ আমি বললাম, ‘তারা বেড়েই চলছে’। তিনি বললেন, ‘তাঁর ধর্মে ঢুকে কেউ কি অসন্তুষ্ট হয়ে তা ত্যাগ করে?’ আমি বললাম, ‘না’। তিনি বললেন, ‘তাঁর দাবীর পূর্বে তোমরা কি কখনো তাঁকে মিথ্যার অভিযোগে অভিযুক্ত করেছ?’ আমি বললাম, ‘না’। তিনি বললেন, ‘তিনি কি সন্ধি ভঙ্গ করেন?’ আমি বললাম, ‘না’। তবে আমরা তাঁর সঙ্গে একটি নির্দিষ্ট সময়ের সন্ধিতে আবদ্ধ আছি। জানি না এর মধ্যে তিনি কি করবেন’। আবূ সুফিয়ান বলেন, ‘এ কথাটি ব্যতীত নিজের পক্ষ হতে আর কোন কথা যোগ করার সু্যোগই আমি পাইনি’। তিনি বললেন, ‘তোমরা তাঁর সঙ্গে কখনো যুদ্ধ করেছ কি?’ আমি বললাম, ‘হ্যাঁ’। তিনি বললেন, ‘তাঁর সঙ্গে তোমাদের যুদ্ধের পরিণাম কি হয়েছে?’ আমি বললাম, ‘তাঁর ও আমাদের মধ্যে যুদ্ধের ফলাফল কুপের বালতির ন্যায়’। কখনো তাঁর পক্ষে যায়, আবার কখনো আমাদের পক্ষে আসে’। তিনি বললেন, ‘তিনি তোমাদের কিসের আদেশ দেন?’ আমি বললাম, ‘তিনি বলেনঃ তোমরা এক আল্লাহর ইবাদত কর এবং তাঁর সঙ্গে কোন কিছুর অংশীদার সাব্যস্ত করো না এবং তোমাদের পূর্বপুরুষরা যা বলে তা ত্যাগ কর। আর তিনি আমাদের সালাত আদায়ের, সত্য বলার, চারিত্রিক নিষ্কলুষতার এবং আত্মীয়দের সঙ্গে সদাচরণ করার নির্দেশ দেন’।\nঅতঃপর তিনি দোভাষীকে বললেন, ‘তুমি তাকে বল, আমি তোমার নিকট তাঁর বংশ সম্পর্কে জিজ্ঞেস করেছি। তুমি তার জবাবে উল্লেখ করেছ যে, তিনি তোমাদের মধ্যে সম্ভ্রান্ত বংশের। প্রকৃতপক্ষে রসূলগণকে তাঁদের কওমের উচ্চ বংশেই পাঠানো হয়ে থাকে। তোমাকে জিজ্ঞেস করেছি, এ কথা তোমাদের মধ্যে ইতিপূর্বে আর কেউ বলেছে কিনা? তুমি বলেছ, ‘না’। তাই আমি বলছি, পূর্বে যদি কেউ এরূপ বলত, তবে আমি অবশ্যই বলতাম, ইনি এমন এক ব্যক্তি, যিনি তাঁর পুর্বসূরীর কথারই অনুসরণ করছেন। আমি তোমাকে জিজ্ঞেস করেছি, তাঁর পূর্বপুরুষদের মধ্যে কোন  বাদশাহ ছিলেন কিনা? তুমি তার জবাবে বলেছ, ‘না’। তাই আমি বলছি যে, তাঁর পূর্বপুরুষের মধ্যে যদি কোন বাদশাহ থাকতেন, তবে আমি বলতাম, ইনি এমন এক ব্যক্তি যিনি তাঁর বাপ-দাদার বাদশাহী ফিরে পেতে চান। আমি তোমাকে জিজ্ঞেস করেছি-এর পূর্বে কখনো তোমরা তাঁকে মিথ্যার অভিযোগে অভিযুক্ত করেছ কিনা? তুমি বলেছ, ‘না’। এতে আমি বুঝলাম, এমনটি হতে পারে না যে, কেউ মানুষের ব্যাপারে মিথ্যা পরিত্যাগ করবে আর আল্লাহর ব্যাপারে মিথ্যা বলবে। আমি তোমাকে জিজ্ঞেস করেছি, সম্ভ্রান্ত লোক তাঁর অনুসরণ করে, না সাধারণ লোক? তুমি বলেছ, সাধারণ লোকই তাঁর অনুসরণ করে। আর বাস্তবেও এই শ্রেনীর লোকেরাই হন রসূলগণের অনুসারী। আমি তোমাকে জিজ্ঞেস করেছি, তারা সংখ্যায় বাড়ছে না কমছে? তুমি বলেছ, বাড়ছে। প্রকৃতপক্ষে ঈমানে পূর্ণতা লাভ করা পর্যন্ত এ রকমই হয়ে থাকে। আমি তোমাকে জিজ্ঞেস করেছি, তাঁর দীনে প্রবেশ করে কেউ কি অসন্তুষ্ট হয়ে তা ত্যাগ করে? তুমি বলেছ, ‘না’। ঈমানের স্নিগ্ধতা অন্তরের সঙ্গে মিশে গেলে ঈমান এরূপই হয়। আমি তোমাকে জিজ্ঞেস করেছি, তিনি সন্ধি ভঙ্গ করেন কিনা? তুমি বলেছ, ‘না’। প্রকৃতপক্ষে রসূলগণ এরূপই, সন্ধি ভঙ্গ করেন না। আমি তোমাকে জিজ্ঞেস করেছি, তিনি তোমাদের কিসের আদেশ দেন? তুমি বলেছ, তিনি তোমাদের এক আল্লাহর বন্দেগী করা ও তাঁর সঙ্গে অন্য কিছুর অংশীদার স্থাপন না করার নির্দেশ দেন। তিনি তোমাদের নিষেধ করেন মূর্তিপূজা করতে আর তোমাদের আদেশ করেন সালাত আদায় করতে, সত্য বলতে ও সচ্চরিত্র থাকতে। তুমি যা বলেছ তা যদি সত্যি হয়, তবে শীঘ্রই তিনি আমার দু’পায়ের নীচের জায়গার অধিকারী হবেন। আমি নিশ্চিত জানতাম, তাঁর আবির্ভাব হবে; কিন্তু তিনি যে তোমাদের মধ্য হতে হবেন, এ কথা ভাবতে পারিনি। যদি জানতাম, আমি তাঁর নিকট পৌছতে পারব, তাঁর সঙ্গে সাক্ষাৎ করার জন্য আমি যে কোন কষ্ট সহ্য করে নিতাম। আর আমি যদি তাঁর নিকট থাকতাম তবে অবশ্যই তাঁর দু’খানা পা ধৌত করে দিতাম। অতঃপর তিনি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সেই পত্রখানি আনার নির্দেশ দিলেন, যা তিনি দিহ্‌ইয়াতুল কালবী (রাঃ)-কে দিয়ে বসরার শাসকের মাধ্যমে হিরাক্লিয়াসের নিকট প্রেরণ করেছিলেন। তিনি তা পড়লেন। তাতে (লেখা) ছিলঃ\nবিসমিল্লা-হির রহমা-নির রহীম (পরম করুণাময় দয়ালু আল্লাহর নামে)। আল্লাহর বান্দা ও তাঁর রসূল মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর পক্ষ হতে রোম সম্রাট হিরাক্লিয়াসের প্রতি। -শান্তি (বর্ষিত হোক) তার প্রতি, যে হিদায়াতের অনুসরণ করে। তারপর আমি আপনাকে ইসলামের দাওয়াত দিচ্ছি। ইসলাম গ্রহণ করুন, শান্তিতে থাকবেন। আল্লাহ আপনাকে দ্বিগুণ প্রতিদান দান করবেন। আর যদি মুখ ফিরিয়ে নেন, তবে সকল প্রজার পাপই আপনার উপর বর্তাবে।\n“হে আহলে কিতাব! এসো সে কথায় যা আমাদের ও তোমাদের মধ্যে এক ও অভিন্ন। তা হল, আমরা যেন আল্লাহ ছাড়া অন্য কারো ইবাদত না করি, কোন কিছুকেই যেন তাঁর শরীক সাব্যস্ত না করি এবং আমাদের কেউ যেন কাউকে পালনকর্তারূপে গ্রহণ না করে আল্লাহকে ত্যাগ করে। যদি তারা মুখ ফিরিয়ে নেয়, তবে তোমরা বল, “তোমরা সাক্ষী থাক, আমারা তো মুসলিম”। (সূরা আল-‘ইমরান ৩/৬৪)\nআবূ সুফিয়ান বলেন, ‘হিরাক্লিয়াস যখন তাঁর বক্তব্য শেষ করলেন এবং পত্র পাঠও শেষ করলেন, তখন সেখানে হট্টগোল শুরু হয়ে গেল, চীৎকার ও হৈ-হল্লা চরমে পৌছল এবং আমাদেরকে বের করে দেয়া হলো। আমাদেরকে বের করে দিলে আমি আমার সাথীদের বললাম, আবূ কাবশার [১] ছেলের বিষয় তো শক্তিশালী হয়ে উঠেছে, বনূ আসফার (রোম)-এর বাদশাহও তাকে ভয় পাচ্ছে! তখন থেকে আমি বিশ্বাস রাখতাম, তিনি শীঘ্রই জয়ী হবেন। অবশেষে আল্লাহ তা’আলা আমাকে ইসলাম গ্রহণের তাওফীক দান করলেন।\nইব্‌ন নাতূর ছিলেন জেরুযালেমের শাসনকর্তা এবং হিরাক্লিয়াসের বন্ধু ও সিরিয়ার খৃস্টানদের পাদ্রী। তিনি বলেন, হিরাক্লিয়াস যখন জেরুজালেম আসেন, তখন একদা তাঁকে অত্যন্ত মলিন দেখাচ্ছিল। তাঁর একজন বিশিষ্ট সহচর বলল, ‘আমরা আপনার চেহারা আজ এত মলিন দেখছি, ইব্‌নু নাতূর বলেন, হিরাক্লিয়াস ছিলেন জ্যোতির্বিদ, জ্যোতির্বিদ্যায় তাঁর দক্ষতা ছিল। তারা জিজ্ঞেস করলে তিনি তাদের বললেন, ‘আজ রাতে আমি তারকারাজির দিকে তাকিয়ে দেখতে পেলাম, খতনাকারীদের বাদশাহ আবির্ভূত হয়েছেন। বর্তমান যুগে কোন্‌ জাতি খাতনা করে’? তারা বলল, ‘ইয়াহূদ জাতি ব্যতীত কেউ খাতনা করে না। কিন্তু তাদের ব্যাপারে আপনি মোটেও চিন্তিত হবেন না। আপনার রাজ্যের শহরগুলোতে লিখে পাঠান, তারা যেন সেখানকার সকল ইয়াহূদীকে কতল করে ফেলে’। তারা যখন এ ব্যাপারে ব্যতিব্যস্ত ছিল, তখন হিরাক্লিয়াসের নিকট জনৈক ব্যক্তিকে হাযির করা হলো, যাকে গাস্‌সানের শাসনকর্তা পাঠিয়েছিল। সে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) সম্পর্কে খবর দিচ্ছিল। হিরাক্লিয়াস তার কাছ থেকে খবর জেনে নিয়ে বললেন, ‘তোমরা একে নিয়ে গিয়ে দেখ, তার খাতনা হয়েছে কি-না’। তারা তাকে নিয়ে গিয়ে দেখে এসে সংবাদ দিল, তার খতনা হয়েছে। হিরাক্লিয়াস তাকে আরবদের সম্পর্কে জিজ্ঞেস করলে সে জওয়াব দিল, ‘তারা খাতনা করে’। অতঃপর হিরাক্লিয়াস তাদের বললেন, ইনি [আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)] এ উম্মতের বাদশাহ। তিনি আবির্ভূত হয়েছেন’। আতঃপর হিরাক্লিয়াস রোমে তাঁর বন্ধুর নিকট লিখলেন। তিনি জ্ঞানে তাঁর সমকক্ষ ছিলেন। পরে হিরাক্লিয়াস হিমস চলে গেলেন। হিমসে থাকতেই তাঁর নিকট তাঁর বন্ধুর চিঠি এলো, যা নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর আবির্ভাব এবং তিনিই যে প্রকৃত নবী, এ ব্যাপারে হিরাক্লিয়াসের মতকে সমর্থন করছিল। তারপর হিরাক্লিয়াস তাঁর হিমসের প্রাসাদে রোমের নেতৃস্থানীয় ব্যক্তিদের ডাকলেন এবং প্রাসাদের সকল দরজা বন্ধ করার আদেশ দিলে দরজা বন্ধ করা হলো। অতঃপর তিনি সম্মুখে এসে বললেন, হে রোমের অধিবাসী! তোমরা কি মঙ্গল, হিদায়াত এবং তোমাদের রাষ্ট্রের স্থায়িত্ব চাও? তাহলে এই নবীর বায়’আত গ্রহণ কর’। এ কথা শুনে তারা বন্য গাধার ন্যায় দ্রুত নিঃশ্বাস ফেলতে ফেলতে দরজার দিকে ছুটল, কিন্তু তারা তা বন্ধ দেখতে পেল। হিরাক্লিয়াস যখন তাদের অনীহা লক্ষ্য করলেন এবং তাদের ঈমান থেকে নিরাশ হয়ে গেলেন, তখন বললেন, ‘ওদের আমার নিকট ফিরিয়ে আন’। তিনি বললেন, ‘আমি একটু পূর্বে যে কথা বলেছি, তা দিয়ে তোমরা তোমাদের দ্বীনের উপর কতটুকু অটল, কেবল তার পরীক্ষা করছিলাম। এখন তা দেখে নিলাম’। একথা শুনে তারা তাঁকে সাজদাহ করল এবং তাঁর প্রতি সন্তুষ্ট হলো। এটাই ছিল হিরাক্লিয়াসের সর্বশেষ অবস্থা।\nআবূ ‘আবদুল্লাহ [বুখারী (রহঃ)] বলেন, সালিহ ইব্‌নু কায়সান (রহঃ) , ইউনুস (রহঃ) ও মা’মার (রহঃ) এ হাদীস যুহরী (রহঃ) থেকে রিওয়ায়াত করেছেন।\n\n (৫১, ২৬৮১, ২৮০৪, ২৯৪১, ২৯৭৮, ৩১৭৪, ৪৫৫৩, ৫৯৮০, ৬২৬০, ৭১৯৬, ৭৫৪১ দ্রষ্টব্য) (আধুনিক প্রকাশনীঃ ৬, ইসলামী ফাউন্ডেশনঃ ৬)",
      ar: "حَدَّثَنَا أَبُو الْيَمَانِ الْحَكَمُ بْنُ نَافِعٍ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ أَبَا سُفْيَانَ بْنَ حَرْبٍ أَخْبَرَهُ أَنَّ هِرَقْلَ أَرْسَلَ إِلَيْهِ فِي رَكْبٍ مِنْ قُرَيْشٍ ـ وَكَانُوا تُجَّارًا بِالشَّأْمِ ـ فِي الْمُدَّةِ الَّتِي كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَادَّ فِيهَا أَبَا سُفْيَانَ وَكُفَّارَ قُرَيْشٍ، فَأَتَوْهُ وَهُمْ بِإِيلِيَاءَ فَدَعَاهُمْ فِي مَجْلِسِهِ، وَحَوْلَهُ عُظَمَاءُ الرُّومِ ثُمَّ دَعَاهُمْ وَدَعَا بِتَرْجُمَانِهِ فَقَالَ أَيُّكُمْ أَقْرَبُ نَسَبًا بِهَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ نَبِيٌّ فَقَالَ أَبُو سُفْيَانَ فَقُلْتُ أَنَا أَقْرَبُهُمْ نَسَبًا‏.‏ فَقَالَ أَدْنُوهُ مِنِّي، وَقَرِّبُوا أَصْحَابَهُ، فَاجْعَلُوهُمْ عِنْدَ ظَهْرِهِ‏.‏ ثُمَّ قَالَ لِتَرْجُمَانِهِ قُلْ لَهُمْ إِنِّي سَائِلٌ هَذَا عَنْ هَذَا الرَّجُلِ، فَإِنْ كَذَبَنِي فَكَذِّبُوهُ‏.‏ فَوَاللَّهِ لَوْلاَ الْحَيَاءُ مِنْ أَنْ يَأْثِرُوا عَلَىَّ كَذِبًا لَكَذَبْتُ عَنْهُ، ثُمَّ كَانَ أَوَّلَ مَا سَأَلَنِي عَنْهُ أَنْ قَالَ كَيْفَ نَسَبُهُ فِيكُمْ قُلْتُ هُوَ فِينَا ذُو نَسَبٍ‏.‏ قَالَ فَهَلْ قَالَ هَذَا الْقَوْلَ مِنْكُمْ أَحَدٌ قَطُّ قَبْلَهُ قُلْتُ لاَ‏.‏ قَالَ فَهَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ قُلْتُ لاَ‏.‏ قَالَ فَأَشْرَافُ النَّاسِ يَتَّبِعُونَهُ أَمْ ضُعَفَاؤُهُمْ فَقُلْتُ بَلْ ضُعَفَاؤُهُمْ‏.‏ قَالَ أَيَزِيدُونَ أَمْ يَنْقُصُونَ قُلْتُ بَلْ يَزِيدُونَ‏.‏ قَالَ فَهَلْ يَرْتَدُّ أَحَدٌ مِنْهُمْ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ قُلْتُ لاَ‏.‏ قَالَ فَهَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ قُلْتُ لاَ‏.‏ قَالَ فَهَلْ يَغْدِرُ قُلْتُ لاَ، وَنَحْنُ مِنْهُ فِي مُدَّةٍ لاَ نَدْرِي مَا هُوَ فَاعِلٌ فِيهَا‏.‏ قَالَ وَلَمْ تُمْكِنِّي كَلِمَةٌ أُدْخِلُ فِيهَا شَيْئًا غَيْرُ هَذِهِ الْكَلِمَةِ‏.‏ قَالَ فَهَلْ قَاتَلْتُمُوهُ قُلْتُ نَعَمْ‏.‏ قَالَ فَكَيْفَ كَانَ قِتَالُكُمْ إِيَّاهُ قُلْتُ الْحَرْبُ بَيْنَنَا وَبَيْنَهُ سِجَالٌ، يَنَالُ مِنَّا وَنَنَالُ مِنْهُ‏.‏ قَالَ مَاذَا يَأْمُرُكُمْ قُلْتُ يَقُولُ اعْبُدُوا اللَّهَ وَحْدَهُ، وَلاَ تُشْرِكُوا بِهِ شَيْئًا، وَاتْرُكُوا مَا يَقُولُ آبَاؤُكُمْ، وَيَأْمُرُنَا بِالصَّلاَةِ وَالصِّدْقِ وَالْعَفَافِ وَالصِّلَةِ‏.‏ فَقَالَ لِلتَّرْجُمَانِ قُلْ لَهُ سَأَلْتُكَ عَنْ نَسَبِهِ، فَذَكَرْتَ أَنَّهُ فِيكُمْ ذُو نَسَبٍ، فَكَذَلِكَ الرُّسُلُ تُبْعَثُ فِي نَسَبِ قَوْمِهَا، وَسَأَلْتُكَ هَلْ قَالَ أَحَدٌ مِنْكُمْ هَذَا الْقَوْلَ فَذَكَرْتَ أَنْ لاَ، فَقُلْتُ لَوْ كَانَ أَحَدٌ قَالَ هَذَا الْقَوْلَ قَبْلَهُ لَقُلْتُ رَجُلٌ يَأْتَسِي بِقَوْلٍ قِيلَ قَبْلَهُ، وَسَأَلْتُكَ هَلْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ فَذَكَرْتَ أَنْ لاَ، قُلْتُ فَلَوْ كَانَ مِنْ آبَائِهِ مِنْ مَلِكٍ قُلْتُ رَجُلٌ يَطْلُبُ مُلْكَ أَبِيهِ، وَسَأَلْتُكَ هَلْ كُنْتُمْ تَتَّهِمُونَهُ بِالْكَذِبِ قَبْلَ أَنْ يَقُولَ مَا قَالَ فَذَكَرْتَ أَنْ لاَ، فَقَدْ أَعْرِفُ أَنَّهُ لَمْ يَكُنْ لِيَذَرَ الْكَذِبَ عَلَى النَّاسِ وَيَكْذِبَ عَلَى اللَّهِ، وَسَأَلْتُكَ أَشْرَافُ النَّاسِ اتَّبَعُوهُ أَمْ ضُعَفَاؤُهُمْ فَذَكَرْتَ أَنَّ ضُعَفَاءَهُمُ اتَّبَعُوهُ، وَهُمْ أَتْبَاعُ الرُّسُلِ، وَسَأَلْتُكَ أَيَزِيدُونَ أَمْ يَنْقُصُونَ فَذَكَرْتَ أَنَّهُمْ يَزِيدُونَ، وَكَذَلِكَ أَمْرُ الإِيمَانِ حَتَّى يَتِمَّ، وَسَأَلْتُكَ أَيَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ فَذَكَرْتَ أَنْ لاَ، وَكَذَلِكَ الإِيمَانُ حِينَ تُخَالِطُ بَشَاشَتُهُ الْقُلُوبَ، وَسَأَلْتُكَ هَلْ يَغْدِرُ فَذَكَرْتَ أَنْ لاَ، وَكَذَلِكَ الرُّسُلُ لاَ تَغْدِرُ، وَسَأَلْتُكَ بِمَا يَأْمُرُكُمْ، فَذَكَرْتَ أَنَّهُ يَأْمُرُكُمْ أَنْ تَعْبُدُوا اللَّهَ، وَلاَ تُشْرِكُوا بِهِ شَيْئًا، وَيَنْهَاكُمْ عَنْ عِبَادَةِ الأَوْثَانِ، وَيَأْمُرُكُمْ بِالصَّلاَةِ وَالصِّدْقِ وَالْعَفَافِ‏.‏ فَإِنْ كَانَ مَا تَقُولُ حَقًّا فَسَيَمْلِكُ مَوْضِعَ قَدَمَىَّ هَاتَيْنِ، وَقَدْ كُنْتُ أَعْلَمُ أَنَّهُ خَارِجٌ، لَمْ أَكُنْ أَظُنُّ أَنَّهُ مِنْكُمْ، فَلَوْ أَنِّي أَعْلَمُ أَنِّي أَخْلُصُ إِلَيْهِ لَتَجَشَّمْتُ لِقَاءَهُ، وَلَوْ كُنْتُ عِنْدَهُ لَغَسَلْتُ عَنْ قَدَمِهِ‏.‏ ثُمَّ دَعَا بِكِتَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّذِي بَعَثَ بِهِ دِحْيَةُ إِلَى عَظِيمِ بُصْرَى، فَدَفَعَهُ إِلَى هِرَقْلَ فَقَرَأَهُ فَإِذَا فِيهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ‏.‏ مِنْ مُحَمَّدٍ عَبْدِ اللَّهِ وَرَسُولِهِ إِلَى هِرَقْلَ عَظِيمِ الرُّومِ‏.‏ سَلاَمٌ عَلَى مَنِ اتَّبَعَ الْهُدَى، أَمَّا بَعْدُ فَإِنِّي أَدْعُوكَ بِدِعَايَةِ الإِسْلاَمِ، أَسْلِمْ تَسْلَمْ، يُؤْتِكَ اللَّهُ أَجْرَكَ مَرَّتَيْنِ، فَإِنْ تَوَلَّيْتَ فَإِنَّ عَلَيْكَ إِثْمَ الأَرِيسِيِّينَ وَ‏{‏يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَنْ لاَ نَعْبُدَ إِلاَّ اللَّهَ وَلاَ نُشْرِكَ بِهِ شَيْئًا وَلاَ يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ‏}‏ قَالَ أَبُو سُفْيَانَ فَلَمَّا قَالَ مَا قَالَ، وَفَرَغَ مِنْ قِرَاءَةِ الْكِتَابِ كَثُرَ عِنْدَهُ الصَّخَبُ، وَارْتَفَعَتِ الأَصْوَاتُ وَأُخْرِجْنَا، فَقُلْتُ لأَصْحَابِي حِينَ أُخْرِجْنَا لَقَدْ أَمِرَ أَمْرُ ابْنِ أَبِي كَبْشَةَ، إِنَّهُ يَخَافُهُ مَلِكُ بَنِي الأَصْفَرِ‏.‏ فَمَا زِلْتُ مُوقِنًا أَنَّهُ سَيَظْهَرُ حَتَّى أَدْخَلَ اللَّهُ عَلَىَّ الإِسْلاَمَ‏.‏ وَكَانَ ابْنُ النَّاظُورِ صَاحِبُ إِيلِيَاءَ وَهِرَقْلَ سُقُفًّا عَلَى نَصَارَى الشَّأْمِ، يُحَدِّثُ أَنَّ هِرَقْلَ حِينَ قَدِمَ إِيلِيَاءَ أَصْبَحَ يَوْمًا خَبِيثَ النَّفْسِ، فَقَالَ بَعْضُ بَطَارِقَتِهِ قَدِ اسْتَنْكَرْنَا هَيْئَتَكَ‏.‏ قَالَ ابْنُ النَّاظُورِ وَكَانَ هِرَقْلُ حَزَّاءً يَنْظُرُ فِي النُّجُومِ، فَقَالَ لَهُمْ حِينَ سَأَلُوهُ إِنِّي رَأَيْتُ اللَّيْلَةَ حِينَ نَظَرْتُ فِي النُّجُومِ مَلِكَ الْخِتَانِ قَدْ ظَهَرَ، فَمَنْ يَخْتَتِنُ مِنْ هَذِهِ الأُمَّةِ قَالُوا لَيْسَ يَخْتَتِنُ إِلاَّ الْيَهُودُ فَلاَ يُهِمَّنَّكَ شَأْنُهُمْ وَاكْتُبْ إِلَى مَدَايِنِ مُلْكِكَ، فَيَقْتُلُوا مَنْ فِيهِمْ مِنَ الْيَهُودِ‏.‏ فَبَيْنَمَا هُمْ عَلَى أَمْرِهِمْ أُتِيَ هِرَقْلُ بِرَجُلٍ أَرْسَلَ بِهِ مَلِكُ غَسَّانَ، يُخْبِرُ عَنْ خَبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا اسْتَخْبَرَهُ هِرَقْلُ قَالَ اذْهَبُوا فَانْظُرُوا أَمُخْتَتِنٌ هُوَ أَمْ لاَ‏.‏ فَنَظَرُوا إِلَيْهِ، فَحَدَّثُوهُ أَنَّهُ مُخْتَتِنٌ، وَسَأَلَهُ عَنِ الْعَرَبِ فَقَالَ هُمْ يَخْتَتِنُونَ‏.‏ فَقَالَ هِرَقْلُ هَذَا مَلِكُ هَذِهِ الأُمَّةِ قَدْ ظَهَرَ‏.‏ ثُمَّ كَتَبَ هِرَقْلُ إِلَى صَاحِبٍ لَهُ بِرُومِيَةَ، وَكَانَ نَظِيرَهُ فِي الْعِلْمِ، وَسَارَ هِرَقْلُ إِلَى حِمْصَ، فَلَمْ يَرِمْ حِمْصَ حَتَّى أَتَاهُ كِتَابٌ مِنْ صَاحِبِهِ يُوَافِقُ رَأْىَ هِرَقْلَ عَلَى خُرُوجِ النَّبِيِّ صلى الله عليه وسلم وَأَنَّهُ نَبِيٌّ، فَأَذِنَ هِرَقْلُ لِعُظَمَاءِ الرُّومِ فِي دَسْكَرَةٍ لَهُ بِحِمْصَ ثُمَّ أَمَرَ بِأَبْوَابِهَا فَغُلِّقَتْ، ثُمَّ اطَّلَعَ فَقَالَ يَا مَعْشَرَ الرُّومِ، هَلْ لَكُمْ فِي الْفَلاَحِ وَالرُّشْدِ وَأَنْ يَثْبُتَ مُلْكُكُمْ فَتُبَايِعُوا هَذَا النَّبِيَّ، فَحَاصُوا حَيْصَةَ حُمُرِ الْوَحْشِ إِلَى الأَبْوَابِ، فَوَجَدُوهَا قَدْ غُلِّقَتْ، فَلَمَّا رَأَى هِرَقْلُ نَفْرَتَهُمْ، وَأَيِسَ مِنَ الإِيمَانِ قَالَ رُدُّوهُمْ عَلَىَّ‏.‏ وَقَالَ إِنِّي قُلْتُ مَقَالَتِي آنِفًا أَخْتَبِرُ بِهَا شِدَّتَكُمْ عَلَى دِينِكُمْ، فَقَدْ رَأَيْتُ‏.‏ فَسَجَدُوا لَهُ وَرَضُوا عَنْهُ، فَكَانَ ذَلِكَ آخِرَ شَأْنِ هِرَقْلَ‏.‏ رَوَاهُ صَالِحُ بْنُ كَيْسَانَ وَيُونُسُ وَمَعْمَرٌ عَنِ الزُّهْرِيِّ‏.‏",
      ar_diacless:
        "حدثنا أبو اليمان الحكم بن نافع، قال أخبرنا شعيب، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عبد الله بن عباس، أخبره أن أبا سفيان بن حرب أخبره أن هرقل أرسل إليه في ركب من قريش ـ وكانوا تجارا بالشأم ـ في المدة التي كان رسول الله صلى الله عليه وسلم ماد فيها أبا سفيان وكفار قريش، فأتوه وهم بإيلياء فدعاهم في مجلسه، وحوله عظماء الروم ثم دعاهم ودعا بترجمانه فقال أيكم أقرب نسبا بهذا الرجل الذي يزعم أنه نبي فقال أبو سفيان فقلت أنا أقربهم نسبا‏.‏ فقال أدنوه مني، وقربوا أصحابه، فاجعلوهم عند ظهره‏.‏ ثم قال لترجمانه قل لهم إني سائل هذا عن هذا الرجل، فإن كذبني فكذبوه‏.‏ فوالله لولا الحياء من أن يأثروا على كذبا لكذبت عنه، ثم كان أول ما سألني عنه أن قال كيف نسبه فيكم قلت هو فينا ذو نسب‏.‏ قال فهل قال هذا القول منكم أحد قط قبله قلت لا‏.‏ قال فهل كان من آبائه من ملك قلت لا‏.‏ قال فأشراف الناس يتبعونه أم ضعفاؤهم فقلت بل ضعفاؤهم‏.‏ قال أيزيدون أم ينقصون قلت بل يزيدون‏.‏ قال فهل يرتد أحد منهم سخطة لدينه بعد أن يدخل فيه قلت لا‏.‏ قال فهل كنتم تتهمونه بالكذب قبل أن يقول ما قال قلت لا‏.‏ قال فهل يغدر قلت لا، ونحن منه في مدة لا ندري ما هو فاعل فيها‏.‏ قال ولم تمكني كلمة أدخل فيها شيئا غير هذه الكلمة‏.‏ قال فهل قاتلتموه قلت نعم‏.‏ قال فكيف كان قتالكم إياه قلت الحرب بيننا وبينه سجال، ينال منا وننال منه‏.‏ قال ماذا يأمركم قلت يقول اعبدوا الله وحده، ولا تشركوا به شيئا، واتركوا ما يقول آباؤكم، ويأمرنا بالصلاة والصدق والعفاف والصلة‏.‏ فقال للترجمان قل له سألتك عن نسبه، فذكرت أنه فيكم ذو نسب، فكذلك الرسل تبعث في نسب قومها، وسألتك هل قال أحد منكم هذا القول فذكرت أن لا، فقلت لو كان أحد قال هذا القول قبله لقلت رجل يأتسي بقول قيل قبله، وسألتك هل كان من آبائه من ملك فذكرت أن لا، قلت فلو كان من آبائه من ملك قلت رجل يطلب ملك أبيه، وسألتك هل كنتم تتهمونه بالكذب قبل أن يقول ما قال فذكرت أن لا، فقد أعرف أنه لم يكن ليذر الكذب على الناس ويكذب على الله، وسألتك أشراف الناس اتبعوه أم ضعفاؤهم فذكرت أن ضعفاءهم اتبعوه، وهم أتباع الرسل، وسألتك أيزيدون أم ينقصون فذكرت أنهم يزيدون، وكذلك أمر الإيمان حتى يتم، وسألتك أيرتد أحد سخطة لدينه بعد أن يدخل فيه فذكرت أن لا، وكذلك الإيمان حين تخالط بشاشته القلوب، وسألتك هل يغدر فذكرت أن لا، وكذلك الرسل لا تغدر، وسألتك بما يأمركم، فذكرت أنه يأمركم أن تعبدوا الله، ولا تشركوا به شيئا، وينهاكم عن عبادة الأوثان، ويأمركم بالصلاة والصدق والعفاف‏.‏ فإن كان ما تقول حقا فسيملك موضع قدمى هاتين، وقد كنت أعلم أنه خارج، لم أكن أظن أنه منكم، فلو أني أعلم أني أخلص إليه لتجشمت لقاءه، ولو كنت عنده لغسلت عن قدمه‏.‏ ثم دعا بكتاب رسول الله صلى الله عليه وسلم الذي بعث به دحية إلى عظيم بصرى، فدفعه إلى هرقل فقرأه فإذا فيه بسم الله الرحمن الرحيم‏.‏ من محمد عبد الله ورسوله إلى هرقل عظيم الروم‏.‏ سلام على من اتبع الهدى، أما بعد فإني أدعوك بدعاية الإسلام، أسلم تسلم، يؤتك الله أجرك مرتين، فإن توليت فإن عليك إثم الأريسيين و‏{‏يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم أن لا نعبد إلا الله ولا نشرك به شيئا ولا يتخذ بعضنا بعضا أربابا من دون الله فإن تولوا فقولوا اشهدوا بأنا مسلمون‏}‏ قال أبو سفيان فلما قال ما قال، وفرغ من قراءة الكتاب كثر عنده الصخب، وارتفعت الأصوات وأخرجنا، فقلت لأصحابي حين أخرجنا لقد أمر أمر ابن أبي كبشة، إنه يخافه ملك بني الأصفر‏.‏ فما زلت موقنا أنه سيظهر حتى أدخل الله على الإسلام‏.‏ وكان ابن الناظور صاحب إيلياء وهرقل سقفا على نصارى الشأم، يحدث أن هرقل حين قدم إيلياء أصبح يوما خبيث النفس، فقال بعض بطارقته قد استنكرنا هيئتك‏.‏ قال ابن الناظور وكان هرقل حزاء ينظر في النجوم، فقال لهم حين سألوه إني رأيت الليلة حين نظرت في النجوم ملك الختان قد ظهر، فمن يختتن من هذه الأمة قالوا ليس يختتن إلا اليهود فلا يهمنك شأنهم واكتب إلى مداين ملكك، فيقتلوا من فيهم من اليهود‏.‏ فبينما هم على أمرهم أتي هرقل برجل أرسل به ملك غسان، يخبر عن خبر رسول الله صلى الله عليه وسلم فلما استخبره هرقل قال اذهبوا فانظروا أمختتن هو أم لا‏.‏ فنظروا إليه، فحدثوه أنه مختتن، وسأله عن العرب فقال هم يختتنون‏.‏ فقال هرقل هذا ملك هذه الأمة قد ظهر‏.‏ ثم كتب هرقل إلى صاحب له برومية، وكان نظيره في العلم، وسار هرقل إلى حمص، فلم يرم حمص حتى أتاه كتاب من صاحبه يوافق رأى هرقل على خروج النبي صلى الله عليه وسلم وأنه نبي، فأذن هرقل لعظماء الروم في دسكرة له بحمص ثم أمر بأبوابها فغلقت، ثم اطلع فقال يا معشر الروم، هل لكم في الفلاح والرشد وأن يثبت ملككم فتبايعوا هذا النبي، فحاصوا حيصة حمر الوحش إلى الأبواب، فوجدوها قد غلقت، فلما رأى هرقل نفرتهم، وأيس من الإيمان قال ردوهم على‏.‏ وقال إني قلت مقالتي آنفا أختبر بها شدتكم على دينكم، فقد رأيت‏.‏ فسجدوا له ورضوا عنه، فكان ذلك آخر شأن هرقل‏.‏ رواه صالح بن كيسان ويونس ومعمر عن الزهري‏.‏",
      note: "[১] আবূ কাবশা : এ নামে জনৈক ব্যক্তি প্রতিমা পূজার বিরোধী ছিল বলে আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে তার ছেলে অর্থাৎ আবূ কাবশা বলা হয়েছে। এ মর্মে আরও কয়েকটি বর্ণনা রয়েছে।",
      grade_id: 2,
      grade: "সহিহ হাদিস",
      grade_color: "#46B891",
      section_title: "১/৬. অধ্যায়ঃ",
      preface: "",
      section_number: "১/৬. অধ্যায়ঃ",
      chapter_title: "ওহীর সূচনা অধ্যায়",
      chapter_number: 1,
    },
  ];
  //copy to clipboard
  const copyToClipboard = async (text) => {
    try {
      await navigator.clipboard.writeText(text);
      toast("লিঙ্ক কপি করা হয়েছে");
    } catch (error) {
      console.log(error);
      alert("Error copying to clipboard:", error);
    }
  };

  return (
    <div className="font-sans lg:pl-5">
      {/* breadcrumbs */}
      <div className="hidden xl:block">
        <div className="text-sm breadcrumbs bg-[#FAFBFB] mr-5 h-14 rounded-t-xl flex items-center ">
          <ul className="ml-5 text-md">
            <li>
              <Image
                src={breadcrumb}
                alt="breadcrumbs book icon "
                width={20}
                height={20}
              />
            </li>
            <li>
              <a>Bukhari</a>
            </li>
            <li>1</li>
          </ul>
        </div>
      </div>

      {/* category name  for lg */}
      <div className="hidden xl:block">
        <div className="h-28 mt-1 mr-5 px-5 lg:flex justify-between items-center bg-white rounded-b-xl  hidden ">
          <div className="flex gap-5  items-center">
            <div>
              <Image
                src={bookLogo}
                alt="book name logo"
                width={40}
                height={40}
              />
            </div>
            <div className="">
              <h1 className="font-bold text-xl mb-3 ">সহিহ বুখারী</h1>
              <p className="text-xs font-bold"> সর্বমোট হাদিস - ৭৫৬৩</p>
            </div>
          </div>
          <div className="font-arabic text-3xl">
            <p>صحيح البخاري</p>
          </div>
        </div>
      </div>

      {/* category name for mb  */}
      <div className="h-14 mt-1 mr-5 px-5 flex justify-between items-center bg-white rounded-lg xl:rounded-b-xl xl:hidden">
        <div className="flex gap-3 items-center">
          {/*
          
          //*drawer
          
          */}
          <div className="drawer">
            <input
              id="my-drawer"
              type="checkbox"
              className="drawer-toggle"
              checked={isDrawerOpen}
            />
            <div className="drawer-content">
              {/* Page content here */}
              <label htmlFor="my-drawer" className=" drawer-button">
                {/* drawer-icon  */}
                <Image
                  src={lineBar}
                  alt="book name logo"
                  width={20}
                  height={20}
                  onClick={handleDrawerToggle}
                />
              </label>
            </div>
            <div className="drawer-side">
              <label
                htmlFor="my-drawer"
                aria-label="close sidebar"
                className="drawer-overlay"
              ></label>
              <span className="bg-white w-[350px] h-[797px] pt-6 px-4 overflow-auto">
                <div className="pb-6 flex justify-between items-center">
                  <p className="font-bangla-v2 font-medium text-2xl ">
                    ক্যাটাগরি
                  </p>
                  {/* cross svg  */}
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    viewBox="0 0 24 24"
                    fill="none"
                    className="size-6"
                    onClick={handleDrawerToggle}
                  >
                    <path
                      d="M6 18L18 6M6 6L18 18"
                      stroke="#4D4D4D"
                      strokeWidth="1.5"
                      strokeLinecap="round"
                      strokeLinejoin="round"
                    ></path>
                  </svg>
                </div>
                <Category />
              </span>
            </div>
          </div>

          <div className="cursor-pointer  whitespace-nowrap">
            <h1 className="font-bold font-bangla-v2">সহিহ বুখারী</h1>
          </div>
        </div>
      </div>

      {/* chapter name  */}
      <div className="h-20 flex items-center bg-white mt-5 rounded-xl gap-5 px-5 mr-5">
        <p className="size-10 bg-[#2B9E76] text-white font-bold rounded-xl inline-block text-center pt-2">
          ১
        </p>
        <p className="text-base font-medium">ওহীর সূচনা অধ্যায়</p>
      </div>

      {/* map start here  */}
      {allHadith?.map((hadith) => (
        <>
          {/* section details  */}
          <div
            className="h-auto bg-white mr-5 mt-5 p-5 rounded-xl flex flex-col justify-center items-stretch gap-10"
            key={hadith?.id}
          >
            <div className="flex items-center gap-3">
              <Image
                src={openBook}
                alt="open book icon"
                width={33}
                height={33}
              />
              <p className="font-semibold">{hadith?.section_number}</p>
            </div>
            <div>
              <p className="font-medium text-sm">{hadith?.section_title}</p>
              <hr className="mt-4 mb-0" />
            </div>

            <div>
              <p className="text-sm">{hadith?.preface}</p>
            </div>
          </div>

          {/* main hadith  */}
          <div
            className="bg-white px-5 mr-5 mt-5 rounded-xl"
            key={hadith?.hadith_id}
          >
            <div className="pt-8 flex gap-4 items-center text-[#2B9E76]">
              <svg
                width="25"
                height="25"
                className="fill-[#2B9E76]"
                viewBox="0 0 25 25"
                fill="green"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path d="M12.5 24.875C12.4259 24.8755 12.3525 24.8613 12.284 24.8333C12.2155 24.8053 12.1531 24.764 12.1006 24.7119L8.89433 21.5H4.06246C3.91327 21.5 3.7702 21.4408 3.66471 21.3353C3.55922 21.2298 3.49996 21.0867 3.49996 20.9375V16.1056L0.288083 12.8994C0.183316 12.794 0.124512 12.6514 0.124512 12.5028C0.124512 12.3542 0.183316 12.2117 0.288083 12.1063L3.49996 8.89439V4.06252C3.49996 3.91333 3.55922 3.77026 3.66471 3.66477C3.7702 3.55928 3.91327 3.50002 4.06246 3.50002H8.89433L12.1062 0.288144C12.2116 0.183378 12.3542 0.124573 12.5028 0.124573C12.6514 0.124573 12.7939 0.183378 12.8993 0.288144L16.1056 3.50002H20.9375C21.0866 3.50002 21.2297 3.55928 21.3352 3.66477C21.4407 3.77026 21.5 3.91333 21.5 4.06252V8.89439L24.7118 12.1063C24.8166 12.2117 24.8754 12.3542 24.8754 12.5028C24.8754 12.6514 24.8166 12.794 24.7118 12.8994L21.5 16.1056V20.9375C21.5 21.0867 21.4407 21.2298 21.3352 21.3353C21.2297 21.4408 21.0866 21.5 20.9375 21.5H16.1056L12.8937 24.7119C12.7889 24.8158 12.6475 24.8744 12.5 24.875ZM4.62496 20.375H9.12496C9.19899 20.3746 9.27237 20.3888 9.34091 20.4168C9.40944 20.4448 9.47177 20.486 9.52433 20.5381L12.5 23.5194L15.4756 20.5438C15.5277 20.4906 15.5898 20.4483 15.6584 20.4194C15.7269 20.3904 15.8005 20.3753 15.875 20.375H20.375V15.875C20.3745 15.801 20.3887 15.7276 20.4167 15.6591C20.4447 15.5905 20.486 15.5282 20.5381 15.4756L23.5193 12.5L20.5437 9.52439C20.4906 9.4723 20.4483 9.41017 20.4193 9.34162C20.3903 9.27306 20.3753 9.19944 20.375 9.12502V4.62502H15.875C15.8009 4.62545 15.7275 4.61126 15.659 4.58326C15.5905 4.55527 15.5281 4.51403 15.4756 4.46189L12.5 1.48064L9.52433 4.46189C9.47177 4.51403 9.40944 4.55527 9.34091 4.58326C9.27237 4.61126 9.19899 4.62545 9.12496 4.62502H4.62496V9.12502C4.62539 9.19905 4.6112 9.27243 4.5832 9.34097C4.55521 9.4095 4.51397 9.47183 4.46183 9.52439L1.48058 12.5L4.45621 15.4756C4.50936 15.5277 4.55164 15.5899 4.58061 15.6584C4.60957 15.727 4.62465 15.8006 4.62496 15.875V20.375Z"></path>
                <path d="M12.5 20.3751C12.4259 20.3755 12.3525 20.3613 12.284 20.3333C12.2155 20.3053 12.1531 20.2641 12.1006 20.212L10.0193 18.1251H7.43746C7.28827 18.1251 7.1452 18.0658 7.03971 17.9603C6.93422 17.8548 6.87496 17.7118 6.87496 17.5626V14.9807L4.78808 12.8938C4.68332 12.7884 4.62451 12.6459 4.62451 12.4973C4.62451 12.3487 4.68332 12.2061 4.78808 12.1007L6.87496 10.0195V7.43758C6.87496 7.2884 6.93422 7.14532 7.03971 7.03983C7.1452 6.93434 7.28827 6.87508 7.43746 6.87508H10.0193L12.1062 4.7882C12.2116 4.68344 12.3542 4.62463 12.5028 4.62463C12.6514 4.62463 12.7939 4.68344 12.8993 4.7882L14.9806 6.87508H17.5625C17.7116 6.87508 17.8547 6.93434 17.9602 7.03983C18.0657 7.14532 18.125 7.2884 18.125 7.43758V10.0195L20.2118 12.1063C20.3166 12.2117 20.3754 12.3543 20.3754 12.5029C20.3754 12.6515 20.3166 12.7941 20.2118 12.8995L18.125 14.9807V17.5626C18.125 17.7118 18.0657 17.8548 17.9602 17.9603C17.8547 18.0658 17.7116 18.1251 17.5625 18.1251H14.9806L12.8937 20.212C12.7889 20.3159 12.6475 20.3745 12.5 20.3751ZM7.99996 17.0001H10.25C10.324 16.9997 10.3974 17.0138 10.4659 17.0418C10.5344 17.0698 10.5968 17.1111 10.6493 17.1632L12.5 19.0195L14.3506 17.1688C14.4027 17.1157 14.4648 17.0734 14.5334 17.0444C14.6019 17.0155 14.6755 17.0004 14.75 17.0001H17V14.7501C16.9995 14.6761 17.0137 14.6027 17.0417 14.5341C17.0697 14.4656 17.111 14.4033 17.1631 14.3507L19.0193 12.5001L17.1687 10.6495C17.1156 10.5974 17.0733 10.5352 17.0443 10.4667C17.0153 10.3981 17.0003 10.3245 17 10.2501V8.00008H14.75C14.6759 8.00051 14.6025 7.98632 14.534 7.95833C14.4655 7.93033 14.4031 7.88909 14.3506 7.83695L12.5 5.9807L10.6493 7.83133C10.5972 7.88448 10.5351 7.92676 10.4666 7.95573C10.398 7.9847 10.3244 7.99977 10.25 8.00008H7.99996V10.2501C8.00039 10.3241 7.9862 10.3975 7.9582 10.466C7.93021 10.5346 7.88897 10.5969 7.83683 10.6495L5.98058 12.5001L7.83121 14.3507C7.88436 14.4028 7.92664 14.4649 7.95561 14.5335C7.98457 14.602 7.99965 14.6757 7.99996 14.7501V17.0001Z"></path>
                <path d="M12.5 14.75C12.055 14.75 11.62 14.618 11.25 14.3708C10.88 14.1236 10.5916 13.7722 10.4213 13.361C10.251 12.9499 10.2064 12.4975 10.2932 12.061C10.3801 11.6246 10.5943 11.2237 10.909 10.909C11.2237 10.5943 11.6246 10.3801 12.061 10.2932C12.4975 10.2064 12.9499 10.251 13.361 10.4213C13.7722 10.5916 14.1236 10.88 14.3708 11.25C14.618 11.62 14.75 12.055 14.75 12.5C14.75 13.0967 14.5129 13.669 14.091 14.091C13.669 14.5129 13.0967 14.75 12.5 14.75ZM12.5 11.375C12.2775 11.375 12.06 11.441 11.875 11.5646C11.69 11.6882 11.5458 11.8639 11.4606 12.0695C11.3755 12.275 11.3532 12.5012 11.3966 12.7195C11.44 12.9377 11.5472 13.1382 11.7045 13.2955C11.8618 13.4528 12.0623 13.56 12.2805 13.6034C12.4988 13.6468 12.725 13.6245 12.9305 13.5394C13.1361 13.4542 13.3118 13.31 13.4354 13.125C13.559 12.94 13.625 12.7225 13.625 12.5C13.625 12.2016 13.5065 11.9155 13.2955 11.7045C13.0845 11.4935 12.7984 11.375 12.5 11.375Z"></path>
              </svg>
              <p className="font-bold text-xl">{hadith?.hadith_id}</p>
            </div>

            {/* hadith details  */}
            <div className="">
              <p className="font-arabic-KFGQ_hafs text-4xl py-10 pl-10 ">
                {hadith?.ar}
              </p>
            </div>
            <div className="">
              <p className="text-[#34AB82] font-semibold font-serif py-5">
                {hadith?.narrator} থেকে বর্ণিতঃ
              </p>
              <p className=" tracking-wider text-base">{hadith?.bn}</p>
            </div>
            <div className="flex justify-between py-14">
              <div>
                <p>
                  হাদিসের মান :{" "}
                  <span className="px-3 py-2 bg-[#46B891] text-white font-medium rounded-xl">
                    {hadith?.grade}
                  </span>
                </p>
              </div>
              <div className="flex justify-between gap-10">
                {" "}
                {/* copy  */}
                <div
                  className="relative group/item cursor-pointer"
                  onClick={() =>
                    copyToClipboard(
                      `${hadith?.narrator} থেকে বর্ণিত, \n\n${hadith?.bn} \n\nসহিহ বুখারী: ${hadith?.hadith_id} \nহাদিসের মান: ${hadith?.grade} \nSource: www.ihadis.com/bukhari/hadith/${hadith?.hadith_id}`
                    )
                  }
                >
                  <Image src={copy} alt="copy icon" width={25} height={25} />

                  {/* pop up  */}
                  <div className="absolute bottom-9 right-[-5px] invisible  group-hover/item:visible">
                    <div className="relative">
                      <p className="p-1 bg-black text-white rounded-lg text-xs">
                        কপি
                      </p>
                      <Image
                        src={triangle}
                        alt="triangle"
                        width={10}
                        height={10}
                        className="absolute left-3"
                      />
                    </div>
                  </div>
                </div>
                {/* bookmark  */}
                <div className="relative group/item cursor-pointer">
                  <Image
                    src={bookmark}
                    alt="copy icon"
                    width={25}
                    height={25}
                    onClick={() => document.getElementById("2").showModal()}
                  />

                  <BookmarkModal id={"2"} />

                  {/* pop up  */}
                  <div className="absolute bottom-9  right-[-5px] invisible  group-hover/item:visible">
                    <div className="relative">
                      <p className="p-1 bg-black text-white rounded-lg text-xs">
                        বুকমার্ক
                      </p>
                      <Image
                        src={triangle}
                        alt="triangle"
                        width={10}
                        height={10}
                        className="absolute left-5"
                      />
                    </div>
                  </div>
                </div>
                {/*share  */}
                <div
                  className="relative group/item cursor-pointer"
                  onClick={() => document.getElementById("1").showModal()}
                >
                  <ShareModal id={"1"} />

                  <Image src={share} alt="copy icon" width={25} height={25} />

                  {/* pop up  */}
                  <div className="absolute bottom-9 right-[-5px] invisible  group-hover/item:visible">
                    <div className="relative">
                      <p className="p-1 bg-black text-white rounded-lg text-xs">
                        শেয়ার
                      </p>
                      <Image
                        src={triangle}
                        alt="triangle"
                        width={10}
                        height={10}
                        className="absolute left-4"
                      />
                    </div>
                  </div>
                </div>
                {/* report  */}
                <div
                  className="relative group/item cursor-pointer"
                  onClick={() => toast.success("শিগ্রই আসছে")}
                >
                  <Image src={report} alt="copy icon" width={25} height={25} />

                  {/* pop up  */}
                  <div className="absolute bottom-9 right-[-5px] invisible  group-hover/item:visible">
                    <div className="relative">
                      <p className="p-1 bg-black text-white rounded-lg text-xs">
                        রিপোর্ট
                      </p>
                      <Image
                        src={triangle}
                        alt="triangle"
                        width={10}
                        height={10}
                        className="absolute left-4"
                      />
                    </div>
                  </div>
                </div>
                {/* direct  */}
                <div className="relative group/item cursor-pointer">
                  <Image src={direct} alt="copy icon" width={25} height={25} />

                  {/* pop up  */}
                  <div className="absolute bottom-9 right-[-5px] invisible  group-hover/item:visible">
                    <div className="relative">
                      <p className="p-1 bg-black text-white rounded-lg text-xs">
                        ডিরেক্ট
                      </p>
                      <Image
                        src={triangle}
                        alt="triangle"
                        width={10}
                        height={10}
                        className="absolute left-4"
                      />
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </>
      ))}
    </div>
  );
};

export default AllHadith;
